<?php
/*Напишіть функцію, яка приймає рядок і число. Поверніть у вигляді масиву
тільки ті слова, довжина яких перевищує число. */

function fun($string, $n) {
    $ws = [];
    $w = explode(" ", $string); //розібрати строку за домомогою роздільника
    for ($i = 0; $i < count($w); $i++) { //пройти по всім елементам
        if (strlen($w[$i]) > $n) {  // порівняти довжину кажного елементу з заданним значенням числа
            $ws[] = $w[$i]; // якщо умова виконується то додати елемент до масиву
        }
    }
    return $ws;
};

$a = "Red Grey Light Dark Blue Green Yellow Pink Orange Brown White Black Violet";

print_r(fun($a, 3));
